
{
    "sessionControls":null,
    "conditions":{
        "userRiskLevels":[],
        "signInRiskLevels":[],
        "clientAppTypes":["all"],
        "servicePrincipalRiskLevels":[],
        "insiderRiskLevels":null,
        "clients":null,
        "platforms":null,
        "locations":null,
        "times":null,
        "deviceStates":null,
        "devices":null,
        "clientApplications":null,
        "authenticationFlows":null
    },
    
    "applications":{
        "includeApplications":["All"],
        "excludeApplications":[],
        "includeUserActions":[],
        "includeAuthenticationContextClassReferences":[],
        "applicationFilter":null,
        "networkAccess":null,
        "globalSecureAccess":null
    },
    
    "users":{
        "includeUsers":["All"],
        "excludeUsers":[],
        "includeGroups":[],
        "excludeGroups":[],
        "includeRoles":[],
        "excludeRoles":["d29b2b05-8046-44ba-8758-1e26182fcf32"],
        "includeGuestsOrExternalUsers":null,
        "excludeGuestsOrExternalUsers":null
    },
    
    "grantControls":{
        "operator":"OR",
        "builtInControls":["mfa","compliantDevice","domainJoinedDevice"],
        "customAuthenticationFactors":[],
        "termsOfUse":[],
        "authenticationStrength@odata.context":"https://graph.microsoft.com/beta/$metadata#conditionalAccess/templates('927c884e-7888-4e81-abc4-bd56ded28985')/details/grantControls/authenticationStrength/$entity",
        "authenticationStrength":null
    },
    
    "displayName":"Require compliant or hybrid Azure AD joined device or multifactor authentication for all users"
}