{
    "sessionControls":null,
    "conditions":{
        "userRiskLevels":[],
        "signInRiskLevels":[],
        "clientAppTypes":["all"],
        "servicePrincipalRiskLevels":[],
        "insiderRiskLevels":null,
        "clients":null,
        "platforms":null,
        "locations":null,
        "times":null,
        "deviceStates":null,
        "devices":null,
        "clientApplications":null,
        "authenticationFlows":null
    },
    
    "applications":{
        "includeApplications":["All"],
        "excludeApplications":[],
        "includeUserActions":[],
        "includeAuthenticationContextClassReferences":[],
        "applicationFilter":null,
        "networkAccess":null,
        "globalSecureAccess":null
    },
        
    "users":{
        "includeUsers":["All"],
        "excludeUsers":[],
        "includeGroups":[],
        "excludeGroups":[],
        "includeRoles":[],
        "excludeRoles":["d29b2b05-8046-44ba-8758-1e26182fcf32"],
        "includeGuestsOrExternalUsers":null,
        "excludeGuestsOrExternalUsers":null
    },
    
    "grantControls":{
        "operator":"OR",
        "builtInControls":["compliantDevice"],
        "customAuthenticationFactors":[],
        "termsOfUse":[],
        "authenticationStrength@odata.context":"https://graph.microsoft.com/beta/$metadata#conditionalAccess/templates('a297dd1a-21fe-4016-99a0-ba43ba64378c')/details/grantControls/authenticationStrength/$entity",
        "authenticationStrength":null
        },
        
        "displayName":"Require MDM-enrolled and compliant device to access cloud apps for all users (Preview)"}